Revit 2026 API

# RenderingImageExposureSettingsSaturation Property

---

The value of rendering image saturation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Saturation { get; set; }
```
```vb
Public Property Saturation As Double
	Get
	Set
```
```cpp
public:
property double Saturation {
	double get ();
	void set (double value);
}
```
```fsharp
member Saturation : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The value of saturation is not valid. The valid range is 0 to 5. |

Increase this value to get more intense colors.

#### Reference

RenderingImageExposureSettings Class

Autodesk.Revit.DB Namespace